---

C#Visual BasicVisual C++

Revit 2024 API
---
SaveAsOptions..::..SetWorksharingOptions Method
SaveAsOptions Class See Also Send Feedback
---

Sets Worksharing options for SaveAs.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014

# Syntax

C#
---

    public void SetWorksharingOptions(
    	WorksharingSaveAsOptions worksharingOptions
    )

Visual Basic
---

    Public Sub SetWorksharingOptions ( _
    	worksharingOptions As WorksharingSaveAsOptions _
    )

Visual C++
---

    public:
    void SetWorksharingOptions(
    	WorksharingSaveAsOptions^ worksharingOptions
    )

#### Parameters

worksharingOptions
    Type: Autodesk.Revit.DB..::..WorksharingSaveAsOptions

Must be nullNothingnullptra null reference (Nothing in Visual Basic) for a non-workshared model.

Allowed to be nullNothingnullptra null reference (Nothing in Visual Basic) for a workshared model, in which case default values for WorksharingSaveAsOptions are used.

# See Also

SaveAsOptions Class

Autodesk.Revit.DB Namespace